#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_variable.example_variable will be created
  + resource "github_actions_variable" "example_variable" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "reusable-workflow-test"
      + updated_at    = (known after apply)
      + value         = "this_is_a_test_value!"
      + variable_name = "terraform_test_variable_a"
    }

  # github_actions_variable.example_variable_2 will be created
  + resource "github_actions_variable" "example_variable_2" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "reusable-workflow-test"
      + updated_at    = (known after apply)
      + value         = "this_is_a_test_value!"
      + variable_name = "terraform_test_variable_b"
    }

  # github_actions_variable.example_variable_3 will be created
  + resource "github_actions_variable" "example_variable_3" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "reusable-workflow-test"
      + updated_at    = (known after apply)
      + value         = "this_is_a_test_value!"
      + variable_name = "terraform_test_variable_c"
    }

  # github_actions_variable.example_variable_4 will be created
  + resource "github_actions_variable" "example_variable_4" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "reusable-workflow-test"
      + updated_at    = (known after apply)
      + value         = "this_is_a_test_value!"
      + variable_name = "terraform_test_variable_d"
    }

  # github_actions_variable.example_variable_5 will be created
  + resource "github_actions_variable" "example_variable_5" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "reusable-workflow-test"
      + updated_at    = (known after apply)
      + value         = "this_is_a_test_value!"
      + variable_name = "terraform_test_variable_e"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @ajh-, Action: `pull_request`*